import React from "react";
import Photo1 from "../../app/assets/image/Rectangle1.png";
import Photo2 from "../../app/assets/image/Rectangle2.png";

function AboutHouse() {
  return (
    <div>
      <h2 className="text-white">بهترین سبک طراحی وبسایت در سال 2024 چیست ؟</h2>
      <p className="text-white">
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده
        از طراحان گرافیک است گرها و متون بلکه روزنامه و مجله در ست...لورم ایپسوم
        متن ساختگی با تولید سادگی نامف...لورم ایپسوم متن ساختگی با تولید سادگی
        نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است گرها و متون بلکه
        روزنامه و مجله ست...لورم ایپسوم متن ساختگی با تولید سادگی نامف...لورم
        ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت.....
      </p>

      <div className="  flex  justify-start items-start w-80 ">
        <img src={Photo1.src} alt="عکس من" />
        <img src={Photo2.src} alt="عکس من" />
      </div>
      <h2 className="text-white">بهترین سبک طراحی وبسایت در سال 2024 چیست ؟</h2>
      <p className="text-white">
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده
        از طراحان گرافیک است گرها و متون بلکه روزنامه و مجله در ست...لورم ایپسوم
        متن ساختگی با تولید سادگی نامف...لورم ایپسوم متن ساختگی با تولید سادگی
        نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است گرها و متون بلکه
        روزنامه و مجله ست...لورم ایپسوم متن ساختگی با تولید سادگی نامف...لورم
        ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت.....
      </p>
    </div>
  );
}

export default AboutHouse;
