"use client";

import Comment from "../common/comments/Comment";
import LandingTitle from "../common/LandingTitle";

const UserComments = () => {
  const comment = [
    {
      id: "1",
      image: "234",
      userFullName: " محمد رضا ساداتی",
      createdAt: "1/2/3 شنبه ",
      message: "” لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ وه از طراحان گرافیک است. چاپگر ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی موردرها و متون بلکه روز استفادمه و مجدلهناز و کاربا نرد.... “ ",
    },
    {
      id: "2",
      image: "234",
      userFullName: " علی اکبر حسینی",
      createdAt: "4/5/6 شنبه ",
      message: "” لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ وه از طراحان گرافیک است. چاپگر ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی موردرها و متون بلکه روز استفادمه و مجدلهناز و کاربا نرد.... “ ",
    },
    {
      id: "3",
      image: "234",
      userFullName: " زهرا محمدی",
      createdAt: "7/8/9 شنبه ",
      message: "” لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ وه از طراحان گرافیک است. چاپگر ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی موردرها و متون بلکه روز استفادمه و مجدلهناز و کاربا نرد.... “ ",
    },
    {
      id: "4",
      image: "234",
      userFullName: " سارا احمدی",
      createdAt: "10/11/12 شنبه ",
      message: "” لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ وه از طراحان گرافیک است. چاپگر ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی موردرها و متون بلکه روز استفادمه و مجدلهناز و کاربا نرد.... “ ",
    },
    {
      id: "5",
      image: "234",
      userFullName: " امیر حسین قاسمی",
      createdAt: "13/14/15 شنبه ",
      message: "” لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ وه از طراحان گرافیک است. چاپگر ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی موردرها و متون بلکه روز استفادمه و مجدلهناز و کاربا نرد.... “ ",
    },
 
  ];

  return (
    <div className="my-20 grid">
      <LandingTitle
        title="نظر کاربران"
        mainTitle="رضایت شما اعتبار و ارزش دلتا را می سازد !"
        details="تیم دلتا با ارائه بهترین نیرو های خدماتی و سرویس های املاکی سعی دارد تا بتواند در تمام لحظات کنار شما باشد ."
      />

      <Comment comment={comment} />
    </div>
  );
};

export default UserComments;
