"use client";

import Comment from "../common/comments/Comment";
import LandingTitle from "../common/LandingTitle";

const UserComments = () => {
  const comment = [
    {
      id: 1,
      image: "234",
      name: " محمد رضا ساداتی",
      date: "1/2/3 شنبه ",
      text: "” لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ وه از طراحان گرافیک است. چاپگر ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی موردرها و متون بلکه روز استفادمه و مجدلهناز و کاربا نرد.... “ ",
    },
    {
      id: 2,
      image: "234",
      name: " محمد رضا ساداتی",
      date: "1/2/3 شنبه ",
      text: "” لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ وه از طراحان گرافیک است. چاپگر ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی موردرها و متون بلکه روز استفادمه و مجدلهناز و کاربا نرد.... “ ",
    },
    {
      id: 3,
      image: "234",
      name: " محمد رضا ساداتی",
      date: "1/2/3 شنبه ",
      text: "” لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ وه از طراحان گرافیک است. چاپگر ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی موردرها و متون بلکه روز استفادمه و مجدلهناز و کاربا نرد.... “ ",
    },
    {
      id: 4,
      image: "234",
      name: " محمد رضا ساداتی",
      date: "1/2/3 شنبه ",
      text: "” لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ وه از طراحان گرافیک است. چاپگر ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی موردرها و متون بلکه روز استفادمه و مجدلهناز و کاربا نرد.... “ ",
    },
    {
      id: 5,
      image: "234",
      name: " محمد رضا ساداتی",
      date: "1/2/3 شنبه ",
      text: "” لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ وه از طراحان گرافیک است. چاپگر ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی موردرها و متون بلکه روز استفادمه و مجدلهناز و کاربا نرد.... “ ",
    },
  ];

  return (
    <div className="my-20 grid">
      <LandingTitle
        title="نظر کاربران"
        mainTitle="رضایت شما اعتبار و ارزش دلتا را می سازد !"
        details="تیم دلتا با ارائه بهترین نیرو های خدماتی و سرویس های املاکی سعی دارد تا بتواند در تمام لحظات کنار شما باشد ."
      />

      <Comment comment={comment} />
    </div>
  );
};

export default UserComments;
